package oop_patterns_lab8;

/*
 * За допомогою шаблона проектування реалізувати отримання різних форм списку 
 * навчальної групи відповідно до таких етапів: формування списку студентів, 
 * які мають потрапити до списку, за заданим критерієм; сортування списку за 
 * заданим параметром; друк списку. Критеріями відбору студентів можуть бути: 
 *      наявність навчальної заборгованості;
 *      наявність фінансової заборгованості. 
 * Параметри, за якими можна сортувати список, -
 *      за прізвищем студента в алфавітному порядку; 
 *      за кількістю предметів, які складають заборгованість 
 *      або за сумою фінансового боргу. 
 * Реалізувати три варіанти таких списків.
 */

/*
 * Template method
 */

public class Oop_patterns_lab8 {

    /**
     * @param args the command line arguments
     */
    public static void main(String[] args) {
        // TODO code application logic here
        System.out.println("hello");
    }
}
