package oop_patterns_lab7;

/*
 * За допомогою шаблона проектування відтворити процес споживання певного
 * продукту. Даний продукт має визначений термін зберігання. У випадку 
 * перевищення терміну зберігання, продукт стає шкідливим для здоров’я людини. 
 * У випадку використання продукту, коли термін його зберігання ще не сплив 
 * (тобто, коли продукт є корисним), загрози здоров’ю споживача немає.
 */

/* 
 * State patternS
 */
public class Oop_patterns_lab7 {

    public static void main(String[] args) {

    }
}
